Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: This value can also be negative and so show an area that is outside of the room, in which case the window colour will be used (this colour can be set with window_set_colour).
zh_cn: 这个值也可以是负数以显示房间外面的区域，这种情况下，将会使用到 窗口颜色（window colour） ，这个颜色可以使用window_set_colour进行设置。

source: This value can then be used in other draw functions, particularly in general 3D and some of the 2D primitive functions.
zh_cn: 这个值可用于其它的绘制函数，特别是普通的3D和2D图元函数。

source: This variable can be used to find out if a particular view is currently visible or not.
zh_cn: 这个变量可以用来发现一个特定的视野当前是否可见。

source: This variable can be used to get or to set the height of the specified viewport.
zh_cn: 这个变量可以用来获取或设置特定视口的高度。

source: This variable can be used to get or to set the height of the view in the room.
zh_cn: 这个变量可以用来获取或设置房间视野的高度。

source: This variable can be used to get or to set the width of the specified viewport.
zh_cn: 这个变量可以用来获取或设置特定视口的宽度。

source: This variable can be used to get or to set the width of the view in the room.
zh_cn: 这个变量可以用来获取或设置房间视野的宽度。

source: This variable can be used to get or to set the x axis position for the view in the room.
zh_cn: 这个变量可以用来获取或设置房间视野的x轴坐标。

source: This variable can be used to get or to set the y axis position for the view in the room.
zh_cn: 这个变量可以用来获取或设置房间视野的y轴坐标。

source: This variable controls the horizontal movement speed of the view when it has an instance to follow (this can be set with the view_object variable or in the room editor).
zh_cn: 视野有跟随物体时（这个可以用 view_object 变量设置或者在 房间编辑器中设置），这个变量控制控制视野的水平速度。

source: This variable controls the vertical movement speed of the view when it has an instance to follow (this can be set with the view_object variable or in the room editor).
zh_cn: 视野有跟随物体时（这个可以用 view_object 变量设置或者在 房间编辑器中设置），这个变量控制控制视野的垂直速度。

source: This variable controls whether any views that are visible within the room are enabled or not.
zh_cn: 这个变量将控制房间内任何可见视野是否启用。This variable controls whether any views that are visible within the room are enabled or not.

source: This variable holds a different constant depending on the orientation of the device.
zh_cn: 这个变量根据设备的方位保存不同的常量。

source: This variable sets the horizontal border width for view following.
zh_cn: 这个变量设置视野跟随的水平边界框的宽度。.

source: This variable sets the vertical border width for view following.
zh_cn: 这个变量设置视野跟随的垂直边界框的宽度。

source: This variable will return a value based on the setting of bits for the different levels.
zh_cn: 这个变量基于不同等级设置的比特值返回一个值。

source: This varies between platforms, but iOS is particularly limited - the apple service only delivers the most recent notification, which must be selected by the recipient for the payload data to be delivered to your async event, and these notifications have a mximum payload size of 256bytes.
zh_cn: 虽然有很多的平台, 但是只有在 iOS 上苹果的服务特别限制仅发送最新的通知，必须通过有效的数据传递给你的异步事件，能够被接收到的有效数据的大小为256个字节。

source: This version is free to download and use, as it is designed to permit the end-user to test the functions of the product before upgrading to a more powerful version.
zh_cn: 这个版本可以免费下载使用，因为它的目的是允许用户在升级到专业版之前测试该产品的功能。

source: This watch enables you to see exactly what is being drawn to any surfaces you have in your game (including the application surface) as well as see the texture pages that are in memory.
zh_cn: 在此视图中允许你查看到底哪些东西正画在你的表面上（包括应用表面）以及查看内存中的材质页。

source: This watch shows you all the information available for the state of the current frame being rendered, like the draw alpha or fill colour.
zh_cn: 这个窗口为你显示所有被渲染当前帧的可用信息，例如绘制的透明度或者填充颜色。

source: This will not affect how the game is played as it is only for setting the angle at which the view is drawn.
zh_cn: 它 不会 影响游戏的玩法，因为它只设置视野 被绘制的角度。

source: This will also open another part of the object window where you can define the physical properties of all instances of this object.
zh_cn: 这将会打开物体窗口的另一部分，在这里你可以定义物体的物理属性。

source: This will clear the screen with the colour blue.
zh_cn: 这将用蓝色填充整个屏幕。

source: This will expand the structures contents, and, in the case of the "Watches" window, permit you to modify them too.
zh_cn: 这样就会展开整个结构内容，并且，在观察的视窗中，也允许你修改它们的值。

source: This will free up the memory associated with all the entries and values for that array.
zh_cn: 这会释放数组所有数据关联的内存。

source: This will open a window another window which will detect and show the keys that you are currently pressing: You need to hold the key combination for 3 seconds and then it will be added to the Key Bindings for that command.
zh_cn: 这将会打开另一个窗口，它会检测并显示你当前按下的按键:: 你需要按住组合键三秒，然后该组合键就会被添加到选定命令的热键。

source: This will return the colour of the pixel at coordinates (56,78) of the surface indexed in the variable "surf".
zh_cn: 这将返回索引为“surf”的表面在在坐标（56,78）位置的像素的颜色。

source: This will set a timer to "push" a notification to the device when one day has passed.
zh_cn: 设置一个定时器在一天后向设备“推送”一个通知。

source: This will set the GUI layer to have a 1:1 scale again and set the draw position to the (0,0) position of the application surface rather than the display or window.
zh_cn: 这个操作会再次设置以1:1的比例，(0,0)的位置，相对于应用表面层作出改变，而不是显示器或窗口。

source: This will then generate your iOS or Mac app for you.
zh_cn: 这将生成你的 iOS 或 MAC 应用软件。

source: This will then let you specify the IP to connect to manually, which will then be saved for future use.
zh_cn: 这样一来就需要你手动定义IP来连接，然后IP会被存起来以便日后使用。

source: This will then prompt you to add a file, or files if your select more than one, to the list.
zh_cn: 随后软件会提示你添加一个或多个你选择的文件到列表中。

source: This will trigger an Asynchronous Push Notification Event, and the ds_map key "type" will have the value "register" as well as a new key, "reg_id", containing the registration id (or an error message in the "error" key, if "status" is 0).
zh_cn: 这将触发一个 异步推送通知事件（Asynchronous Push Notification Event），你会得到一个 ds_map 数组，他的key "type" 的值为 "register" ，key"reg_id"的值为 注册ID（registration id） (如果在"error" 的"status" 为 0 的话说明发生了错误)。

source: This window is for when you select an instance from your game.
zh_cn: 这个窗口是为了你在游戏中选择的实例而存在的。

source: This window is for you to add a specific variable that you want to keep track of.
zh_cn: 这个窗口可以让你添加你想一直追踪的特定的变量。

source: This window is where you can see the current system profile for the game being tested where you can check everything in your game from whole events to individual function calls to see how they are performing and spot any trouble areas or bottlenecks.
zh_cn: 该窗口是你查看当前被测试游戏所处系统概况的地方，在此处你能查看你游戏中从整个事件到单独的函数调用中的各种细节，以此了解程序如何表现它们的功能，而麻烦区域或者瓶颈又在哪里。

source: This window simply shows the output of the compiler (as shown in the main IDE compiler window).
zh_cn: 这个窗口仅仅会显示编译器的输出（正如主IDE编译器窗口中显示的一样）。

source: This window will display the current call stack of events, as well as the line number for the code being stepped through.
zh_cn: 这个窗口会显示当前事件的调用栈，还有按步跳过代码的行号。

source: This works as follows - First statement1 is executed, then the expression is evaluated and, if it is true, statement 3 is executed.
zh_cn: 工作原理 - 首先执行语句1，然后判断表达式，表达式为真则执行语句3。

source: This works as follows:
zh_cn: 工作流程如下：

source: This would add "." to all the strings held in the cells within the defined region of the ds_grid referenced by the variable "grid".
zh_cn: 这将会向索引为变量"grid"的栅格结构中确定区域内的单元格中的所有字符串叠加一个"."。

source: This would add 2 to all the values held in the cells within the defined disk area of the ds_grid referenced by the variable "grid".
zh_cn: 这将会向索引为变量"grid"的栅格结构中确定圆盘区域内的单元格中的所有值叠加2。

source: This would add 6 to the given cell within the ds_grid referenced by the variable "grid".
zh_cn: 这将会向索引为变量"grid"的栅格结构中被给定的单元格叠加6.

source: This would set my_x to the x coordinate of the mouse relative to the display.
zh_cn: 上述将设置 my_x 等于相对于显示器的鼠标x坐标。

source: This would set my_y to the y coordinate of the mouse relative to the display.
zh_cn: 上述将设置 my_y 为屏幕上的鼠标的y坐标。

source: This would set myx to the x coordinate of the mouse in the window relative to all active views.
zh_cn: 这个将设置myx 等于窗口中相对于所有激活视野的鼠标x坐标。

source: This would set myy to the y coordinate of the mouse in the window relative to all active views.
zh_cn: 这个将设置myy 等于窗口中相对于所有激活视野的鼠标y坐标。

source: This would set the variable "dpx" to the dpi value of the x axis.
zh_cn: 设置变量“dpx”等于x轴的dpi值。

source: This would set the variable "dpy" to the dpi value of the y axis.
zh_cn: 设置变量“dpy”等于y轴的dpi值。

source: This would set the variable "myheight" to the display's height.
zh_cn: 设置变量“myheight”为显示器的高度。

source: This would set the variable "mywidth" to the display's width.
zh_cn: 设置变量“mywidth”为显示器的宽度。

source: Time Lines
zh_cn: 时间轴

source: Timelines
zh_cn: 时间轴

source: Timelines offer you a way to create and control instances and actions over a set time period.
zh_cn: 时间轴功能让你能够根据一组时间节点来创建和控制实例以及动作。

source: To access the available modules, you must run your Steam Client, go to the Library and right click on the GameMaker: Studio entry.
zh_cn: 要访问可用的模块，必须运行你的Steam客户端，找到游戏库，右键点击 GameMaker: Studio 条目。

source: To access this surface, you need to use the built-in global variable application_surface which is explained on the following page:
zh_cn: 若要访问这个表面层，你需要用到内置变量application_surface，接下来的章节会进行解释：

source: To achieve this you can make a time line where you start with setting a motion to the left.
zh_cn: 要做到这个，你可以通过创建一个时间轴，在起始时间设置向左运动。

source: To add a file to your resources you must right-click on the Included Files section of the resource tree and select Create Included File or, if you want to create a sub-directory to store other files, Create Group.
zh_cn: 要向资源中添加一个文件，你必须右击资源列表中的 Included Files 项，然后选择 Create Included File；或者如果你想要创建一个文件夹来储存其它文件，那么选择 Create Group。

source: To add a sound resource to your game, use the Resource menu or right-click on the resource tree and select Create Sound, or you can use the corresponding button on the toolbar.
zh_cn: 你可以使用 Resource 菜单或右键点击资源树选择 Create Sound 或使用工具栏上相应的按钮添加声音资源。

source: To assign a path to an instance of an object, you can use the path actions (covered in the section Actions - Move Actions) or you can use code.
zh_cn: 要在一个物体的实例上绑定一个路径，你可以使用路径动作（动作 - 运动动作章节有详细介绍），或者可以使用代码来完成。

source: To begin creating your first game project, you can click on either the New Project tab, where you can select to either load a previous project, or start a new one.
zh_cn: 你可以点击 New Project 选项卡创建你的第一个游戏工程。在这里你可以选择加载老版本工程或者新建一个工程。

source: To call a script from within a piece of code, just act the same way as when calling functions - that is, write the script name with the argument values in parentheses.
zh_cn: 在一个代码块中调用脚本就像调用函数一样 - 使用脚本的名字，括号内填写参数的值。

source: To change a Key, simply right-click on it and select the key, or key combination, that you require from the lists presented and your shortcut will be created.
zh_cn: 要改变按键，只需要 右击 需要修改的的按键，并选择按键、或组合键，然后它就会出现在列表中，你的自定义快捷键将被创建。

source: To create a background resource in your game, use the Create Background option from the drop-down Resources menu or use the corresponding button on the toolbar.
zh_cn: 用 Resources 下拉菜单的 Create Background 选项或者工具栏上相应的按钮创建背景。

source: To create a font resource in your game, use the item Create Font in the Resources menu or use the corresponding button on the toolbar, which will cause the following window to pop up: As with all resources, you should give your font resource a unique name so that you (and GameMaker: Studio) can identify it while writing your game.
zh_cn: 要在你的游戏中创建一个字体资源，你可以点击 Resources 菜单中的 Create Font ，或者点击工具栏对应的按钮，之后会弹出以下窗口： 就和其它资源一样，每个字体资源你都需要指定一个独一无二的名称，这样你（以及 GameMaker: Studio）才可以在编写游戏时区分不同的资源。

source: To create a new path resource in your game, choose Create Path from the Resources menu (or right click on the path resource and select Create Path), which will open the following window where you can create a new path (the image shows a path already created): As you can see, most of the path editor is taken up with the a visual representation of the space your path is drawn in, but around the edges there are a number of buttons, tabs and information bars that are there to help you in the task of creating and changing the paths you make.
zh_cn: 要在游戏中创建新的路径，只需要点击 Resources 菜单中的 Create Path 选项（或者右击 路径资源然后选择 Create Path，在接下来的窗口中你可以创建一个新路径（下图中已经创建了一条路径）： 如你所见，占了路径编辑器绝大部分的是展示你绘制的路径的可视化界面，但是在编辑器边缘还有许多的按钮、选项卡和信息栏，这些工具帮你完成路径的创建和修改。.

source: To create a sprite, choose the item Create Sprite from the Resources menu, or use the corresponding button on the toolbar.
zh_cn: 用 Resources 菜单的 Create Sprite 按钮或者工具栏上相应的按钮

source: To create a time line, choose Create Time Line from the Resources menu, or right click on the time line resource in the resource tree and select Create Time Line or you can just click on the create a time line icon found on the resource toolbar at the top of the main screen.
zh_cn: 要创建一个时间轴，在 Resources 菜单中选择 Create Time Line ，或者右击资源树里的时间轴资源然后选择 Create Time Line，又或者直接点击窗口顶部的资源工具栏中的创建时间轴按钮即可。

source: To create an object in your game, choose Create Object from the Resources menu (or click the equivalent button on the toolbar) and the following window will open:
zh_cn: 选择 Resources 菜单的 Create Object 按钮 (或点击工具栏上相应的按钮) 就可以打开下列窗口:

source: To display this page you need a browser with JavaScript support.
zh_cn: 要显示这一页，你需要浏览器支持JavaScript 。

source: To do that we use EVENTS.
zh_cn: 我们使用 EVENTS (事件).完成这项工作。

source: To do this, you simply have to specify the array variable (no need for each of the individual entries, nor the [] brackets) and the array will be passed by reference into the script.
zh_cn: 做到这点，仅需指定指定变量数组（不需要每个入口独立传入）并作为脚本的一个参数。

source: To execute a script from an object or a time line you can use the Execute Script action , but you can also call it in a code box using the actual script name as if it were a function or even by using the GML function script_execute.
zh_cn: 要在对象或者时间线中执行一个脚本，你可以使用 Execute Script 动作，不过你也可以在一个代码框里直接用脚本的名称来调用它，就和调用一个内建函数一样，再或者可以通过函数 script_execute 来调用。 To execute a script from an object or a time line you can use the Execute Script action , but you can also call it in a code box using the actual script name as if it were a function or even by using the GML function script_execute.

source: To load a sprite, click on the button Load Sprite.
zh_cn: 单击 Load Sprite 加载精灵。

source: To open a new watch, simply click on an empty area (which should show the text "select window type") or right-click on the top window bar and choose a new "Type".
zh_cn: 为了打开一个新的监视窗口，只要点击空白区域（这玩意会显示一行字："select window type"）就行，或者右击子窗口顶端的横条然后选择一个新的“类型”。

source: To play other games that are available on the Workshop from other users you must also subscribe to them, and all subscribed games will then appear in the Steam Player, which will update as you subscribe to them to show all the available games.
zh_cn: 玩其他游戏只需要订阅其他游戏即可，所有订阅的游戏会显示在 Steam 播放器，会显示所有游戏的可用更新。

source: To prevent any view following, you can set this variable using the special keyword noone.
zh_cn: 阻止视野跟随，你可以设置这个变量为特别的 关键词 noone.

source: To prevent this you can use various different cloud services, which offer data storage over the internet for retrieval and modification at any time.
zh_cn: 为了防止这种情况的出现您可以使用各种不同的云服务 ，用来提供可以修改和检索数据的云端据存储服务。

source: To rectify this we should have formatted the code as follows:
zh_cn: 为纠正这一点，重写代码如下：

source: To start with we need to initialise our surface variable in the Create Event of a controller instance:
zh_cn: 首先我们需要在创建事件（Create Event）中初始化表面变量。

source: To that end, you must have defined the canvas element correctly within the *.html page of your game using the correct sizes and names that correspond to the surfaces you wish to create.
zh_cn: 为此，你 必须准确定的定义 *.html 游戏页面的画布元素，使用正确的大小和名称，以符合要创建的表面层。

source: To this end, click with the left mouse button on the sprite box or the menu button next to it and a pop-up dialogue will appear with a list of all the available sprites from the resource tree, then just select the one you want to use for the object.
zh_cn: 单机左边的精灵框或其右边的按钮，就可以选择精灵了。

source: To understand this better, take, for example, an action (or a code in GML) and think about how it works... you place it in an event and specify a number of parameters and it will make your instance do something.
zh_cn: 为了让你更好的理解，让我们拿对象的一个动作来举个例子：你把动作添加到事件中，同时指定好一些相应的参数，那么你的实例就会执行你设置的动作。To understand this better, take, for example, an action (or a code in GML) and think about how it works... you place it in an event and specify a number of parameters and it will make your instance do something.

source: To use a background as a tile set, check the box labelled Use as tile set and the background window now changes to look as follows: Now you can indicate a number of settings for the tile set, like the width and height for each tile (only one size can be given, so better make sure that all tiles in the set have the same size.
zh_cn: 要使用磁贴，勾选 Use as tile set ，背景窗口就会变成下面这样: 你可以设置磁贴的宽度和高度。

source: To use the Mac OS X target module, you will need to have a Mac computer with an Intel chipset and running Mavericks (OSX 10.9) OS or above.
zh_cn: 使用 Mac OS X 模块，您需要一个拥有 Intel 芯片以及运行 Mavericks (OS X 10.9) 或更高版本的 Mac 电脑。

source: To use this License, you must now start GameMaker: Studio and go to "Help", "Update License" and enter your new license in the appropriate area.
zh_cn: 要使用这个许可证，你必须现在启动 GameMaker: Studio 并进入 "Help"，"Update License"，然后在适当的区域输入新的许可证。

source: Toggle vertical synchronisation to on (true) or off (false).
zh_cn: 切换垂直同步为开启（真）或关闭（假）

source: Type in the keyword to find:
zh_cn: 输入要查找的关键字：

source: Type in the word(s) to search for:
zh_cn: 输入要搜索的字符：

source: Typical objects can be walls, moving balls, the main player controlled character, enemies, and anything else you can think of from games that you have played!
zh_cn: 典型的物体是墙、移动的小球，玩家控制的角色、敌人和其他任何您可以从玩过的游戏中想到的元素！

source: Typically a remote push notification would just indicate that new data is available from your server for example.
zh_cn: 举个例子，通常一个远程推送式通知就表明服务器上有新的数据。

source: Typically it is used to avoid an instance running a specific block of code in, for example a collision event.
zh_cn: 通常它是用来避免运行一个特定的代码块，比如碰撞事件。

source: Unary
zh_cn: 一元运算符

source: Unlike previous versions of GameMaker this form cannot be shown to the player and as such it is the ideal place to store snippets of information and to plan your game.
zh_cn: 不像以前版本的 GameMaker，这个游戏信息并不会展示给玩家，因此它是储存信息和计划你的游戏的好地方。

source: Unlike the regular "Save" command, this will export and save all the game information, whether it has changed or not.
zh_cn: 不同于 "Save" 命令，该命令会导出并保存 所有 游戏信息无论更改与否。

source: Updating Your Games
zh_cn: 升级你的游戏

source: Uploading To The Steam Workshop
zh_cn: 上传到 Steam 创意工坊

source: Use an alternative method (true) or the regular method (false).
zh_cn: 使用替代的方法（true）或者常规的方法（false）。

source: Use this button to change the time steps for the currently selected moment.
zh_cn: 这个按钮可以修改当前选定的时刻的时间。

source: Use this button to clear the entire list of moments.
zh_cn: 这个按钮可以删除整个时刻列表中的所有时刻。

source: Use this button to delete a moment or a range of moments.
zh_cn: 这个按钮可以删除一个或多个时刻范围。

source: Use this button to merge a number of moments into a single one.
zh_cn: 这个按钮可以把多个时刻的动作合并到一个时刻上来。

source: Use this button to shift a range of moment to a new moment.
zh_cn: 这个按钮是用来平移一个时刻范围到一个新的时刻。

source: Use this button to spread out a range of moments by adding time between them or put them closer together by removing time between them.
zh_cn: 这个按钮可以让你延长或者缩短一个时刻范围。

source: Use this to add a moment to the time line.
zh_cn: 这个按钮可以向时间轴中添加一个时刻。

source: Uses Physics
zh_cn: 使用物理

source: Using GameMaker: Studio
zh_cn: 使用 GameMaker: Studio

source: Using Scripts
zh_cn: 使用脚本

source: Using a variable to set an instance value:
zh_cn: 使用变量设置实例的值：

source: Variables and Variable Scope
zh_cn: 变量和变量的作用域

source: Versions
zh_cn: 版本

source: Very useful!
zh_cn: 很用用吧！！

source: Views
zh_cn: 视野

source: Views are one of the most important of the display properties that you can manipulate with GameMaker: Studio.
zh_cn: 视野是GameMaker: Studio可以操作的显示属性中最重要的一个。

source: Views, however, govern what you see within that window, and so have another series of functions dedicated to them.
zh_cn: 而视野，给出窗口能看到什么， 所以有另外一个系列专用的函数。

source: Visible
zh_cn: 可见

source: Visible indicates whether instances of this object are visible when the room starts.
zh_cn: 可见指的是房间开始时该物体的实例是否可见。

source: Watches
zh_cn: Watches（监视子画面）

source: We all know that playing computer games is fun.
zh_cn: 我们都知道，玩电脑游戏很有趣。

source: We also cover the constants and variables that GML has available to control all aspects of your game.
zh_cn: 我们已经尽可能的覆盖了您在设计游戏过程中所可能需要的常量和变量。

source: We now have the objects to spawn instances of and their corresponding x and y spawn coordinates within the room all stored in our array.
zh_cn: 现在我们在数组储存的坐标对应的位置产生物体的实例。

source: We set the surface variable to -1, as all surface functions should really be used in the Draw events to prevent odd errors or undefined behaviours.
zh_cn: 由于所有的表面函数真正在 Draw 事件中使 用，为了防止奇怪的错误或者未定义的行为，我们设置表面变量为-1。

source: We will briefly discuss the various menu items, buttons, etc... below, but they will be covered far more in-depth in the later sections of the manual.
zh_cn: 下面我们将简单地介绍各种菜单、按钮等... 但更深入的部分将在手册的后面讲解。

source: Welcome to the GameMaker: Studio user manual!
zh_cn: 欢迎使用 GameMaker: Studio 用户手册！

source: Well for that we have to manually type each and every position ourselves, but there is a nice trick to help us keep track of things there too!
zh_cn: 这种情况就需要我们自己手动输入，不过这里也有一个小技巧。

source: Well, an array has to be initialized before we can use it or GameMaker: Studio will give us an error.
zh_cn: 数组需要 初始化 之后才能使用，否则 GameMaker: Studio 会报错。

source: Well, here are just a few things that would be impossible without arrays -
zh_cn: 有一些事情没有数组将非常为难 -

source: Well, masks are what govern collisions in GameMaker: Studio.
zh_cn: 遮罩是 GameMaker: Studio 中支配碰撞事件的主角。

source: Well, something like this...
zh_cn: 好吧，就像这样……

source: Well, we can use a 2D array to do this and save writing out a load of code.
zh_cn: 那么，我们可以像这样使用二维数组，相比其它的方式，节省了很多代码。

source: Well, when an object has a parent, it can share code, actions and events with that parent.
zh_cn: 好吧，当一个物体有一个父对，它就可以共享它的父对的代、动作和事件。

source: What Is A Script?
zh_cn: 脚本是什么？

source: What Is A Vector?
zh_cn: 什么是向量?

source: What Is Steam Workshop?
zh_cn: 什么是 Steam 创意工坊？

source: What arguments you provide to this function will depend on the effect you wish it to have on the GUI layer.
zh_cn: 函数提供什么参数，决定于想要在GUI层表达什么样的效果。

source: What does it look like?
zh_cn: 像什么？

source: What does that mean?
zh_cn: 为什么这样做呢？

source: What this will do is force all your sound files (irrespective of whether they are *.wav or *.mp3) to be compressed down to Ogg Vorbis *.ogg format files for all platforms.
zh_cn: 压缩会使得你所有的声音文件 (无论是 *.wav 还是 *.mp3) 被压缩成适用于所有平台的 Ogg Vorbis 格式的 *.ogg 文件。

source: Whatever method you choose will open the following window:
zh_cn: 无论你用那种方法，都会看到接下来的这个窗口：

source: Whatever your skill level, we hope that this manual helps you to realise the true power within GameMaker: Studio and make your gaming dreams become reality!
zh_cn: 不论你的技术水平如何，我们都希望通过这个手册帮助你认识到 GameMaker: Studio的真正力量，实现你游戏制作的梦想。

source: When an object has a sprite, it also has a mask.
zh_cn: 当物体有一个精灵，它也有一个遮罩。

source: When creating rooms you can then add these subimages at different places to create beautiful levels with graphical effects that are "cheap" in that they use very little processing power to draw.
zh_cn: 有时候你想要把背景分解成一系列磁贴，这意味着，一个大的图像可以由小图像组合在一起。当创建房间时你可以添加这些子图像来做出很棒的关卡而不需要占用大量系统资源来绘制图像。

source: When different moments become the same their action lists will be merged.
zh_cn: 如果不同的时刻出现重叠，那么它们的动作列表将会被合并。

source: When doing multiple operations in a single expression, it is very important that you use brackets () to separate out the order of operation, as different platforms may perform them differently if nor explicitly stated in this way.
zh_cn: 当一个表达式做多项运算时，使用括号“()”分离出运算顺序，这将 非常重要，如果没有明确的用这种方法表明，不同的平台执行上可能会有所不同。和gm不同，GMS可以在全局游戏设定（Global Game Setting）中开启短路求值（Short-Circuit evaluations）。
